/*
 * сборщик мусора - мусоросборщик
 * 
 * 3 поколения
 * 
 * Large object heap >85kb
 * 
 * маркировка - перемещение - уплотнение/дефрагментация
 * таблицы доступа адреса старые новые
 * 
 * граф объектов, корни приложения
 * 
 * управляемая и неуправляемая память
 * 
 * финализатор
 * 
 * * * * * * * * * * * * * * * * * * * * * * * *
 * Делигат - тип для хранения ссылок на методы
 * 
 * Делигат нельзя в интерфейсе - событие можно
 * события... подписчики... канал на ютубе...
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */